# FamilyParameterNoExist Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..FamilyParameterNoExist Property
BuiltInFailures..::..FamilyFailures Class See Also
---
The parameter [Name] doesn't exist in the Family. It will be ignored.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FamilyParameterNoExist { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyParameterNoExist As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FamilyParameterNoExist {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace